# Terminal & Shell
brew "fzf"
brew "htop"
brew "jq"
brew "ripgrep"
brew "tmux"
brew "wget"
brew "grep"
brew "coreutils"
brew "make"

# Editor
brew "neovim"
brew "stylua"
brew "tree-sitter"

# Git
brew "git"
brew "lazygit"

# Languages & Version Managers
brew "pyenv"
brew "pipenv"
brew "pipx"
brew "rustup"
brew "deno"

# Build Tools
brew "cmake"
brew "automake"
brew "bison"
brew "boost"
brew "llvm"
brew "pkgconf"

# iOS/macOS Development
brew "carthage"
brew "cocoapods"

# Media
brew "ffmpeg"
brew "imagemagick"
brew "jpegoptim"
brew "optipng"
brew "mpv"
brew "atomicparsley"
brew "exiftool"

# PDF
brew "pdfgrep"
brew "pdfsandwich"

# Networking
brew "nmap"
brew "iperf3"
brew "http-server"

# AI
brew "ollama"

# Other
brew "dict"
brew "p7zip"
brew "yuicompressor"

# Casks
cask "cursor-cli"
cask "font-iosevka-nerd-font"
cask "macs-fan-control"
cask "mactex-no-gui"
cask "transmission"

# VS Code Extensions
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-extension-pack"
vscode "dunstontc.viml"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "kevinrose.vsc-python-indent"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "rust-lang.rust-analyzer"
vscode "simonsiefke.svg-preview"
vscode "tyriar.sort-lines"
